Revit 2027 API
BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailable Property
 There aren't enough slots on panel [Panel Name], so the circuit will connect through Feed Through Lugs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailable { get; }
Public Shared ReadOnly Property NotEnoughSlotsOnlyLugAvailable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughSlotsOnlyLugAvailable {
	FailureDefinitionId^ get ();
}
static member NotEnoughSlotsOnlyLugAvailable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace